
## Plan Result (list-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/59022)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 0 to change, 2 to destroy.</code></pre>

* Replace
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4
  * local_file.application_ecs_service_appspec_94386B9C


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 must be replaced
-/+ resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/ListAPI-Prod:995" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/ListAPI-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "996905175585.dkr.ecr.us-east-1.amazonaws.com/listapi-prod-app:4bccfbb7058f50f9de78a8b1e5cc69cfa491f4eb" -> "996905175585.dkr.ecr.us-east-1.amazonaws.com/listapi-prod-app:1194e79b5ecf4d60ce0ca72bdcbf921298ea91df"
                    name                   = "app"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (9 unchanged attributes hidden)
                },
              ~ {
                    name                   = "aws-otel-collector"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (10 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "ListAPI-Prod" -> (known after apply)
      ~ revision                 = 995 -> (known after apply)
        tags                     = {
            "environment" = "Prod"
            "service"     = "ListAPI"
        }
        # (10 unchanged attributes hidden)
    }

  # local_file.application_ecs_service_appspec_94386B9C must be replaced
-/+ resource "local_file" "application_ecs_service_appspec_94386B9C" {
      ~ content              = jsonencode(
            {
              - Resources = [
                  - {
                      - TargetService = {
                          - Properties = {
                              - LoadBalancerInfo = {
                                  - ContainerName = "app"
                                  - ContainerPort = 4005
                                }
                              - TaskDefinition   = "arn:aws:ecs:us-east-1:996905175585:task-definition/ListAPI-Prod:995"
                            }
                          - Type       = "AWS::ECS::Service"
                        }
                    },
                ]
              - version   = 1
            } # forces replacement
        ) -> (known after apply) # forces replacement
      ~ content_base64sha256 = "r1cCHW/529SB9Rk48DVCzkdh0j9ck/Pbn/43P/75Ejg=" -> (known after apply)
      ~ content_base64sha512 = "DNgueip+werFi1ECfqPstrD4n0KVZ3DxbVsntvoSVxGy97C9ytnprrODJQNv2ZGz3Y+oLFzkP4hjwJrVTxRo3A==" -> (known after apply)
      ~ content_md5          = "e91c1e2024b8c1e43f8cada72cc32001" -> (known after apply)
      ~ content_sha1         = "08191124a78c75dca97191f0bf20673206579b52" -> (known after apply)
      ~ content_sha256       = "af57021d6ff9dbd481f51938f03542ce4761d23f5c93f3db9ffe373ffef91238" -> (known after apply)
      ~ content_sha512       = "0cd82e7a2a7ec1eac58b51027ea3ecb6b0f89f42956770f16d5b27b6fa125711b2f7b0bdcad9e9aeb38325036fd991b3dd8fa82c5ce43f8863c09ad54f1468dc" -> (known after apply)
      ~ id                   = "08191124a78c75dca97191f0bf20673206579b52" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"b9c67332-3fb3-4e2f-be9b-4e92fa04042c","JobName":"list-api_infrastructure_plan_prod","PRNumber":210,"Program":"tfcmt","SHA1":"1194e79b5ecf4d60ce0ca72bdcbf921298ea91df","Target":"list-api-cdk","Vars":{}} -->